export const ar = {
  auth: {
    missingAuthHeader: "رأس التوثيق مفقود.",
    missingJWT: "رمز التوثيق مفقود.",
    expiredToken: "انتهت صلاحية الرمز.",
    invalidToken: "رمز غير صالح.",
    registered: "تم تسجيلك بنجاح.",
    loggedIn: "تم تسجيل الدخول بنجاح.",
    alreadyExist: "هذا المستخدم موجود بالفعل."
  },
  user: {
    notFoundByPhoneNumber: "لا يوجد مستخدم بهذا الرقم.",
    deleted: "تم حذف حسابك بنجاح.",
    imageUploaded: "تم رفع الصورة بنجاح.",
    noUserAnymore: "المستخدم لم يعد موجوداً."
  },
  common: {
    wrongParams: "معطيات غير صحيحة.",
    internalServerError: "حدث خطأ في الخادم.",
    noFileImageUploaded: "لا يوجد ملف متاح للرفع.",
    fileNotInServer: "الملف غير موجود على الخادم."
  },
  validation: {
    wrongPassword: "كلمة المرور غير صحيحة.",
    username: "اسم المستخدم يجب أن يكون من 4 إلى 20 حرفًا ويحتوي فقط على أحرف وأرقام وشرطات (-).",
    userRole: "دور المستخدم يجب أن يكون طالبًا أو مدرسًا.",
    name: "يجب أن يكون الاسم أقل من 50 حرفًا.",
    phone: "رقم الهاتف غير صالح.",
    videoName: "يجب أن يكون اسم الفيديو أقل من 170 حرفًا.",
    courseName: "استخدم اسمًا أقصر للدورة، أقل من 150 حرفًا.",
    description: "الوصف يجب أن يكون أقل من 350 حرفًا.",
    passwordMin: "يجب أن تكون كلمة المرور أطول من 12 حرفًا.",
    passwordMax: "يجب أن تكون كلمة المرور أقل من 24 حرفًا.",
    otp: "رمز التحقق (OTP) يجب أن يتكون من 6 أرقام فقط."
  },
  errors: {
    username: {
      invalid: "اسم المستخدم يجب أن يكون من 4 إلى 20 حرفًا ويحتوي فقط على أحرف أو أرقام أو شرطات (-)."
    },
    userRole: {
      invalid: "الدور يجب أن يكون إما طالبًا أو مدرسًا."
    },
    name: {
      too_long: "الاسم يجب ألا يتجاوز 50 حرفًا."
    },
    phone: {
      invalid: "رقم الهاتف غير صالح."
    },
    video: {
      invalid_url: "رابط الفيديو غير صالح.",
      name_too_long: "اسم الفيديو يجب ألا يتجاوز 170 حرفًا."
    },
    course: {
      name_too_long: "استخدم اسمًا أقصر للدورة (أقل من 150 حرفًا).",
      invalid_price: "سعر الدورة يجب أن يكون عددًا صحيحًا غير سالب.",
      invalid_offer: "العرض يجب أن يكون عددًا صحيحًا غير سالب.",
      invalid_thumbnail: "رابط الصورة المصغّرة غير صالح.",
      description_too_long: "الوصف يجب ألا يتجاوز 350 حرفًا."
    },
    password: {
      too_short: "كلمة المرور يجب أن تكون أطول من 12 حرفًا.",
      too_long: "كلمة المرور يجب ألا تتجاوز 24 حرفًا."
    },
    teacher: {
      invalid_image: "صورة المدرس يجب أن تكون رابطًا صالحًا.",
      otp_invalid: "رمز التحقق (OTP) يجب أن يتكون من 6 أرقام بالضبط."
    },
    student: {
      otp_invalid: "رمز التحقق (OTP) يجب أن يتكون من 6 أرقام بالضبط."
    }
  }
};
