
export const ar = {
  auth: {
    missingAuthHeader: "رأس التوثيق مفقود.",
    missingJWT: "رمز التوثيق مفقود.",
    expiredToken: "انتهت صلاحية الرمز.",
    invalidToken: "رمز غير صالح.",
    registered: "تم تسجيلك بنجاح.",
    loggedIn: "تم تسجيل الدخول بنجاح.",
  },
  user: {
    notFound: "هذا المستخدم لم يعد موجودًا.",
    deleted: "تم حذف حسابك بنجاح.",
    imageUploaded: "تم رفع الصورة بنجاح.",
  },
  common: {
    wrongParams: "عنوان خطئ.",
    internalServerError: "خطأ في السرفر."
  },
  validation: {
    username: "اسم المستخدم يجب أن يكون من 4 إلى 20 حرفًا ويحتوي فقط على أحرف وأرقام وشرطات (-).",
    userRole: "المستخدم يجب أن يكون طالبًا أو مدرسًا.",
    name: "يجب أن يكون اسمك أقل من 50 حرفًا.",
    phone: "رقم الهاتف غير صحيح.",
    videoName: "يجب أن يكون الاسم أقل من 170 حرفًا.",
    courseName: "استخدم اسمًا أقصر للدورة، أقل من 150 حرفًا.",
    description: "يجب أن يكون الوصف أقل من 350 حرفًا.",
    passwordMin: "يجب أن تكون كلمة المرور أكثر من 12 حرفًا.",
    passwordMax: "يجب أن تكون كلمة المرور أقل من 24 حرفًا.",
    otp: "رمز التحقق OTP يجب أن يتكون من 6 أرقام فقط.",
  }
};